# Setting up cask dir
cask_args appdir:'~/Applications'

# Homebrew Bundle
tap 'homebrew/bundle'

## caskroom/cask
tap 'caskroom/cask'
brew 'cask'

## homebrew/binary
tap 'homebrew/binary'

# Updating native GNU core
brew 'coreutils'

# Aditional Tools
brew 'moreutils'

# Find/Locate to macOS
brew 'findutils'

# --- Apps and Tools ---
# Development
brew 'bash'
brew 'docker'
# brew 'gdrive'
brew 'git'
# brew 'htop'
brew 'bash-completion'
# brew 'grc'
# brew 'jq'
# brew 'libgit2'
brew 'm-cli'
# brew 'mysql'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'python'
brew 'ruby-build'
brew 'rbenv'
brew 'spaceman-diff'
# brew 'spark'
brew 'tmux'
brew 'unrar'
brew 'tree'
brew 'wget'
brew 'yarn'
brew 'speedtest_cli'

# Essential Every-day apps
cask 'skype'
cask 'daisydisk'
cask 'alfred'
cask 'iterm2'
cask 'textual'
cask 'macvim'
cask 'mamp'
cask 'photoshop'
cask 'lightroom'
cask 'discord'
cask 'mongodb'
cask 'github-desktop'
cask 'hyper'
cask 'ngrok'
cask 'robomongo'
cask 'slack'
cask 'transmission'
cask 'virtualbox'
cask 'vlc'
cask 'java'
cask 'firefox'
cask 'cloudapp'

# Code editors
cask 'sublime-text'
cask 'atom'

# Google Slavery
cask 'google-chrome'
cask 'google-drive'
# cask 'google-photos-backup'

# Personal Productivity apps
cask 'dropbox'
cask '1password'
cask 'bartender'
# cask 'icons8'
cask 'keepingyouawake'
cask 'moom'
# cask 'spectacle'

# Others
cask 'spotify'
cask 'spotify-notifications'
# cask 'whatsapp'

# CTF tools
brew 'aircrack-ng'
brew 'bfg'
brew 'binutils'
brew 'binwalk'
brew 'cifer'
brew 'dex2jar'
brew 'dns2tcp'
brew 'fcrackzip'
brew 'foremost'
brew 'hashpump'
brew 'hydra'
brew 'john'
brew 'knock'
brew 'netpbm'
brew 'nmap'
brew 'pngcheck'
brew 'socat'
brew 'sqlmap'
brew 'tcpflow'
brew 'tcpreplay'
brew 'tcptrace'
brew 'ucspi-tcp'
brew 'xz'

# => AppStore Apps
brew 'mas'
# mas '1176895641' # Spark
#mas 'keynote', 409183694  # keynote
#mas 'xcode', 497799835  # xcode