# Setting up cask dir
cask_args appdir:'~/Applications'

# Taps we need to make this all work
tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'neovim/neovim'

# Updating native GNU core
# brew 'coreutils'

# Aditional Tools
brew 'moreutils'

# Find/Locate to macOS
brew 'findutils'

# Install Packages
brew 'bash'
brew 'docker'
# brew 'gdrive'
brew 'git'
# brew 'htop'
brew 'bash-completion'
# brew 'grc'
# brew 'jq'
# brew 'libgit2'
brew 'm-cli'
# brew 'mysql'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'python'
brew 'ruby-build'
brew 'rbenv'
brew 'spaceman-diff'
# brew 'spark'
brew 'tmux'
brew 'unrar'
brew 'tree'
brew 'wget'
brew 'yarn'
brew 'speedtest_cli'
brew 'redis'
brew 'heroku'
brew 'neovim'

# Essential Every-day apps
cask 'skype'
cask 'daisydisk'
cask 'alfred'
cask 'iterm2'
cask 'textual'
cask 'macvim'
cask 'mamp'
cask 'discord'
cask 'mongodb'
cask 'github-desktop'
cask 'hyper'
cask 'ngrok'
cask 'robomongo'
cask 'slack'
cask 'virtualbox'
cask 'vlc'
cask 'java'
cask 'firefox'
cask 'cloudapp'
cask 'sketch'

# Code editors
cask 'sublime-text'
cask 'atom'

# Google Slavery
cask 'google-chrome'
cask 'google-drive'
# cask 'google-photos-backup'

# Personal Productivity apps
cask 'dropbox'
cask '1password'
cask 'bartender'
# cask 'icons8'
cask 'keepingyouawake'
cask 'moom'
# cask 'spectacle'
cask 'spotify'
cask 'spotify-notifications'


# Take so much time / Install later
# cask 'photoshop'
# cask 'lightroom'

# Install Mac App Store Apps
# brew 'mas'
# mas '1176895641' # Spark
# mas 'keynote', 409183694  # keynote
# mas 'Tweetbot', id: 557168941 #tweetbot
#mas 'xcode', 497799835  # xcode
